app/controllers/api_controller.rb

SELECT DISTINCT neighborhood FROM "listings"
---
  def neighborhoods
    nabes = Listing.select(:neighborhood).uniq